src/Catalogs/События/События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>События</name>
  <owners>Catalog.Кампании</owners>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/СобытияКампанииСервер/Module.bsl
// Серверный слой выборки событий активной кампании для агенды.
//
// Назначение:
//   - выполнять campaign-scoped выборку событий справочника События;
//   - фильтровать помеченные на удаление;
//   - реализовать семантику точечных и интервальных событий;
//   - поддерживать пересечение с ограниченным диапазоном
//     (from_minute..to_minute);
//   - поддерживать открытую agenda без правой границы
//     (уже идущие + начинающиеся сейчас или позже);
//   - применять детерминированную сортировку;
//   - возвращать признак наличия дополнительных результатов
//     (limit + 1).
//
// Слой не отвечает за:
//   - JSON Schema и tool descriptor;
//   - стабильный код ошибки (success/error);
//   - строковый UUID;
//   - машинный код статуса перечисления;
//   - представление игровой даты;
//   - проверку аргументов AI-инструмента и активной кампании
//     (это делает вызывающий слой ИнструментыАссистентаСервер).
//
// Результат функции - внутренний read result, а не AI DTO.
// Возвращаемая структура:
//
//   {
//     Элементы  - Массив Из Структура:
//                 {
//                   Ссылка       - СправочникСсылка.События;
//                   Наименование - Строка;
//                   Начало       - Число - минута игрового времени;
//                   Окончание    - Число - минута игрового времени,
//                                  0 для точечного события;
//                   Статус       - ПеречислениеСсылка.СтатусыСобытий;
//                 };
//     ЕстьЕще  - Булево - есть ли ещё результаты сверх лимита.
//   }
//
// Привилегированный режим не используется.

#Область ПрограммныйИнтерфейс

// Возвращает read result предметной выборки событий активной кампании
// для агенды.
//
// Параметры:
//   Кампания         - СправочникСсылка.Кампании - активная кампания.
//   МинутаНачала     - Число - левая граница диапазона (включительно).
//   МинутаОкончания  - Число, Неопределено - правая граница диапазона
//                      (включительно). Если Неопределено - открытая agenda
//                      без правой границы (limit + 1).
//   Лимит            - Число - 1..50, фактический размер страницы.
//
// Возвращаемое значение:
//   Структура - read result с полями:
//     * Элементы - Массив Из Структура - внутренние строки событий;
//     * ЕстьЕще  - Булево - есть ли ещё результаты сверх лимита.
//
Функция ПолучитьАгенду(Кампания, МинутаНачала, МинутаОкончания = Неопределено, Лимит = 20) Экспорт

	Возврат ВыбратьСобытияАгенды(Кампания, МинутаНачала, МинутаОкончания, Лимит);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет предметную выборку событий активной кампании для агенды
// на уровне СУБД. Не загружает весь календарь кампании в память.
//
// Применяется Top-N с limit + 1 для определения признака наличия
// дополнительных результатов без отдельного запроса COUNT.
//
// Параметры:
//   Кампания         - СправочникСсылка.Кампании - активная кампания.
//   МинутаНачала     - Число - левая граница (включительно).
//   МинутаОкончания  - Число, Неопределено - правая граница (включительно),
//                      либо Неопределено для открытой agenda.
//   Лимит            - Число - 1..50.
//
// Возвращаемое значение:
//   Структура - {Элементы, ЕстьЕще}.
//
Функция ВыбратьСобытияАгенды(Кампания, МинутаНачала, МинутаОкончания, Лимит)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания",     Кампания);
	Запрос.УстановитьПараметр("FromMinute",   МинутаНачала);
	Запрос.УстановитьПараметр("Предел",       Лимит + 1);

	Если МинутаОкончания <> Неопределено Тогда
		Запрос.УстановитьПараметр("ToMinute", МинутаОкончания);
		Запрос.Текст = ТекстЗапросаАгендыОграниченный();
	Иначе
		Запрос.Текст = ТекстЗапросаАгендыОткрытой();
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();

	Элементы = Новый Массив;
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		Если Сч < Лимит Тогда
			Описание = Новый Структура;
			Описание.Вставить("Ссылка",         Выборка.Ссылка);
			Описание.Вставить("Наименование",   Выборка.Наименование);
			Описание.Вставить("Начало",         Выборка.Начало);
			Описание.Вставить("Окончание",      Выборка.Окончание);
			Описание.Вставить("Статус",         Выборка.Статус);
			Элементы.Добавить(Описание);
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;

	ЕстьЕще = (Сч > Лимит);

	Результат = Новый Структура;
	Результат.Вставить("Элементы", Элементы);
	Результат.Вставить("ЕстьЕще",  ЕстьЕще);

	Возврат Результат;

КонецФункции

// Формирует текст запроса для ограниченного диапазона
// from_minute..to_minute.
//
// Разделяет точечные и интервальные события:
//
//   Точечное событие (Окончание = 0):
//     Начало МЕЖДУ &FromMinute И &ToMinute.
//
//   Интервальное событие (Окончание <> 0):
//     Начало <= &ToMinute И Окончание >= &FromMinute.
//
// Это эквивалентно интервалу, у которого хотя бы одна точка
// попадает внутрь диапазона, но разнесено по двум независимым
// веткам, чтобы избежать смешения условий.
//
// Сортировка детерминированная:
//   Начало, Окончание, Наименование, Ссылка.
//
Функция ТекстЗапросаАгендыОграниченный()

	Возврат
		"ВЫБРАТЬ ПЕРВЫЕ &Предел
		|	Спр.Ссылка КАК Ссылка,
		|	Спр.Наименование КАК Наименование,
		|	Спр.Начало КАК Начало,
		|	Спр.Окончание КАК Окончание,
		|	Спр.Статус КАК Статус
		|ИЗ
		|	Справочник.События КАК Спр
		|ГДЕ
		|	Спр.Владелец = &Кампания
		|	И НЕ Спр.ПометкаУдаления
		|	И (
		|		(Спр.Окончание = 0
		|			И Спр.Начало МЕЖДУ &FromMinute И &ToMinute)
		|		ИЛИ
		|		(Спр.Окончание <> 0
		|			И Спр.Начало <= &ToMinute
		|			И Спр.Окончание >= &FromMinute)
		|	)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Спр.Начало,
		|	Спр.Окончание,
		|	Спр.Наименование,
		|	Спр.Ссылка";

КонецФункции

// Формирует текст запроса для открытой agenda без правой границы.
//
// Включает только две группы:
//
//   1) Уже идущие события:
//        Окончание <> 0
//        И Начало < &FromMinute
//        И Окончание >= &FromMinute
//
//   2) Начинающиеся сейчас или позже (включая точечные):
//        Начало >= &FromMinute
//
// Точечные события в прошлом (Начало < FromMinute И Окончание = 0)
// не удовлетворяют ни одной из ветвей и потому не возвращаются.
// Для них не требуется отдельного исключения - они просто
// отсеиваются условиями.
//
// Сортировка детерминированная, сначала по рангу группы (уже идущие =
// 1, начинающиеся сейчас или позже = 2), затем:
//   Начало, Окончание, Наименование, Ссылка.
//
Функция ТекстЗапросаАгендыОткрытой()

	Возврат
		"ВЫБРАТЬ ПЕРВЫЕ &Предел
		|	Спр.Ссылка КАК Ссылка,
		|	Спр.Наименование КАК Наименование,
		|	Спр.Начало КАК Начало,
		|	Спр.Окончание КАК Окончание,
		|	Спр.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА Спр.Начало < &FromMinute
		|				И Спр.Окончание <> 0
		|				И Спр.Окончание >= &FromMinute
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК РангГруппы
		|ИЗ
		|	Справочник.События КАК Спр
		|ГДЕ
		|	Спр.Владелец = &Кампания
		|	И НЕ Спр.ПометкаУдаления
		|	И (
		|		(Спр.Окончание <> 0
		|			И Спр.Начало < &FromMinute
		|			И Спр.Окончание >= &FromMinute)
		|		ИЛИ
		|		(Спр.Начало >= &FromMinute)
		|	)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РангГруппы,
		|	Спр.Начало,
		|	Спр.Окончание,
		|	Спр.Наименование,
		|	Спр.Ссылка";

КонецФункции

#КонецОбласти
